In [1]:
import pandas as pd

In [4]:
con=pd.read_csv(r"C:\Users\ELCOT\Downloads\txt_method.csv")
con.head(3)

              Name    Position Title   Department  Employee Annual Salary
0      AARON,ELVIA  WATER RATE TAKER  WATER MGMNT               1000000.0
1  AARON,JEFFDRY M    POLICE OFFICER      POLICE                2000000.0
2    AARON,KIMBELE    POLICE OFFICER      POLICE                      NaN

In [5]:
con.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    8 non-null      object
 1   Position Title          8 non-null      object
 2   Department              7 non-null      object
 3   Employee Annual Salary  6 non-null      float64
dtypes: float64(1), object(3)
memory usage: 384.0+ bytes

In [6]:
con["Department"].nunique()

4

In [7]:
con.nunique()

Name                      8
Position Title            5
Department                4
Employee Annual Salary    6
dtype: int64

In [9]:
con["Department"]=con["Department"].astype("category")

In [10]:
con.head(3)

              Name    Position Title   Department  Employee Annual Salary
0      AARON,ELVIA  WATER RATE TAKER  WATER MGMNT               1000000.0
1  AARON,JEFFDRY M    POLICE OFFICER      POLICE                2000000.0
2    AARON,KIMBELE    POLICE OFFICER      POLICE                      NaN

In [11]:
con.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    8 non-null      object
 1   Position Title          8 non-null      object
 2   Department              7 non-null      category
 3   Employee Annual Salary  6 non-null      float64
dtypes: category(1), float64(1), object(2)
memory usage: 532.0+ bytes

# Commn String Methods-lower(),.upper(),.tittle() and .len()

In [12]:
con=pd.read_csv(r"C:\Users\ELCOT\Downloads\txt_method.csv")
con["Department"]=con["Department"].astype("category")
con.head(3)

              Name    Position Title   Department  Employee Annual Salary
0      AARON,ELVIA  WATER RATE TAKER  WATER MGMNT               1000000.0
1  AARON,JEFFDRY M    POLICE OFFICER      POLICE                2000000.0
2    AARON,KIMBELE    POLICE OFFICER      POLICE                      NaN

In [14]:
"Hello World".lower()
"hello world".upper()

'HELLO WORLD'

In [15]:
"hello world".capitalize()

'Hello world'

In [17]:
"hello world".title()

'Hello World'

In [18]:
len("hello world")

11

In [24]:
con["Name"].str.title()
con["Name"].str.lower()
con["Name"].str.upper()
con["Name"].str.capitalize()

0          Aaron,elvia
1      Aaron,jeffdry m
2        Aaron,kimbele
3      Abad jr,vicente
4     Zygowice,peter r
5      Zymantar,mark e
6    Zyrkowski,carld e
7     Zyskowski,darliz
Name: Name, dtype: object

In [25]:
con["Name"].str.lower().str.upper()

0          AARON,ELVIA
1      AARON,JEFFDRY M
2        AARON,KIMBELE
3      ABAD JR,VICENTE
4     ZYGOWICE,PETER R
5      ZYMANTAR,MARK E
6    ZYRKOWSKI,CARLD E
7     ZYSKOWSKI,DARLIZ
Name: Name, dtype: object

In [27]:
con["Position Title"]=con["Position Title"].str.title()

In [28]:
con.head(3)

              Name    Position Title   Department  Employee Annual Salary
0      AARON,ELVIA  Water Rate Taker  WATER MGMNT               1000000.0
1  AARON,JEFFDRY M    Police Officer      POLICE                2000000.0
2    AARON,KIMBELE    Police Officer      POLICE                      NaN

In [29]:
con["Position Title"].str.len()

0    16
1    14
2    14
3    23
4    15
5    14
6    20
7    14
Name: Position Title, dtype: int64

# The .str .replace() Method

In [37]:
con=pd.read_csv(r"C:\Users\ELCOT\Downloads\txt_method.csv").dropna(how="all")
con["Department"]=con["Department"].astype("category")
con.tail(3)

                Name        Position Title Department  Employee Annual Salary
5    ZYMANTAR,MARK E        POLICE OFFICER        NaN               8443000.0
6  ZYRKOWSKI,CARLD E  CHEF DATABASE ANALYS    POLICE               11330000.0
7   ZYSKOWSKI,DARLIZ        POLICE OFFICER    POLICE                      NaN

In [34]:
"Hello world".replace("l","!")

'He!!o wor!d'

In [41]:
con["Department"]=con["Department"].str.replace("MGMNT","MANGEMENT")

In [42]:
con.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON,ELVIA",WATER RATE TAKER,WATER MANGEMENT,1000000.0
1,"AARON,JEFFDRY M",POLICE OFFICER,POLICE,2000000.0
2,"AARON,KIMBELE",POLICE OFFICER,POLICE,NaN
3,"ABAD JR,VICENTE",CHEF CONTRACT EXPEDITER,GENERAL SERVICES,6000000.0
4,"ZYGOWICE,PETER R",CIVIL ENGINEER,WATER MOMENT,5000000.0

In [ ]:
con["Employee Annual Salary"]=con["Employee Annual Salary"].str.replace("$","").astype("float")
con.head(4)

In [46]:
con["Employee Annual Salary"].sum()

33773000.0

# Filtering With string Methods

In [48]:
con=pd.read_csv(r"C:\Users\ELCOT\Downloads\txt_method.csv").dropna(how="all")
con["Department"]=con["Department"].astype("category")
con.tail(4)

,Name,Position Title,Department,Employee Annual Salary
4,"ZYGOWICE,PETER R",CIVIL ENGINEER,WATER MOMENT,5000000.0
5,"ZYMANTAR,MARK E",POLICE OFFICER,NaN,8443000.0
6,"ZYRKOWSKI,CARLD E",CHEF DATABASE ANALYS,POLICE,11330000.0
7,"ZYSKOWSKI,DARLIZ",POLICE OFFICER,POLICE,NaN

In [51]:
con["Position Title"].str.lower()

0           water rate taker
1             police officer
2             police officer
3    chef contract expediter
4            civil engineer
5             police officer
6       chef database analys
7             police officer
Name: Position Title, dtype: object

In [53]:
txt=con["Position Title"].str.lower().str.contains("water")
con[txt]

          Name    Position Title   Department  Employee Annual Salary
0  AARON,ELVIA  WATER RATE TAKER  WATER MGMNT               1000000.0

In [55]:
con[con["Position Title"].str.lower().str.startswith("water")]

          Name    Position Title   Department  Employee Annual Salary
0  AARON,ELVIA  WATER RATE TAKER  WATER MGMNT               1000000.0

In [58]:
mask=con["Position Title"].str.lower().str.endswith("water")
con[mask]

Empty DataFrame
Columns: [Name, Position Title, Department, Employee Annual Salary]
Index: []

# More string Methods- .strip(),.lstrip(),.rstrip()

In [59]:
con=pd.read_csv(r"C:\Users\ELCOT\Downloads\txt_method.csv").dropna(how="all")
con["Department"]=con["Department"].astype("category")
con.tail(4)

,Name,Position Title,Department,Employee Annual Salary
4,"ZYGOWICE,PETER R",CIVIL ENGINEER,WATER MOMENT,5000000.0
5,"ZYMANTAR,MARK E",POLICE OFFICER,NaN,8443000.0
6,"ZYRKOWSKI,CARLD E",CHEF DATABASE ANALYS,POLICE,11330000.0
7,"ZYSKOWSKI,DARLIZ",POLICE OFFICER,POLICE,NaN

In [67]:
"       Hello World".strip()

'Hello World'

In [70]:
con["Name"]

0          AARON,ELVIA
1      AARON,JEFFDRY M
2        AARON,KIMBELE
3      ABAD JR,VICENTE
4     ZYGOWICE,PETER R
5      ZYMANTAR,MARK E
6    ZYRKOWSKI,CARLD E
7     ZYSKOWSKI,DARLIZ
Name: Name, dtype: object

In [73]:
con["Name"]=con["Name"].str.rstrip().str.lstrip()
con.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON,ELVIA",WATER RATE TAKER,WATER MGMNT,1000000.0
1,"AARON,JEFFDRY M",POLICE OFFICER,POLICE,2000000.0
2,"AARON,KIMBELE",POLICE OFFICER,POLICE,NaN
3,"ABAD JR,VICENTE",CHEF CONTRACT EXPEDITER,GENERAL SERVICES,6000000.0
4,"ZYGOWICE,PETER R",CIVIL ENGINEER,WATER MOMENT,5000000.0

In [74]:
con["Position Title"]=con["Position Title"].str.strip()

# String Methods on Index and Columns

In [76]:
con=pd.read_csv(r"C:\Users\ELCOT\Downloads\txt_method.csv",index_col="Name").dropna(how="all")
con["Department"]=con["Department"].astype("category")
con.tail(4)

                         Position Title    Department  Employee Annual Salary
Name
ZYGOWICE,PETER R        CIVIL ENGINEER   WATER MOMENT               5000000.0
ZYMANTAR,MARK E          POLICE OFFICER           NaN               8443000.0
ZYRKOWSKI,CARLD E  CHEF DATABASE ANALYS       POLICE               11330000.0
ZYSKOWSKI,DARLIZ         POLICE OFFICER       POLICE                      NaN

In [80]:
con.index=con.index.str.strip().str.title()

In [81]:
con.head(3)

                   Position Title   Department  Employee Annual Salary
Name
Aaron,Elvia      WATER RATE TAKER  WATER MGMNT               1000000.0
Aaron,Jeffdry M    POLICE OFFICER      POLICE                2000000.0
Aaron,Kimbele      POLICE OFFICER      POLICE                      NaN

In [84]:
con.columns=con.columns.str.upper()

In [85]:
con.head(3)

                   POSITION TITLE   DEPARTMENT  EMPLOYEE ANNUAL SALARY
Name
Aaron,Elvia      WATER RATE TAKER  WATER MGMNT               1000000.0
Aaron,Jeffdry M    POLICE OFFICER      POLICE                2000000.0
Aaron,Kimbele      POLICE OFFICER      POLICE                      NaN

# Split Strings By characters with .str.split() Method

In [88]:
con=pd.read_csv(r"C:\Users\ELCOT\Downloads\txt_method.csv").dropna(how="all")
con["Department"]=con["Department"].astype("category")
con.tail(4)

,Name,Position Title,Department,Employee Annual Salary
4,"ZYGOWICE,PETER R",CIVIL ENGINEER,WATER MOMENT,5000000.0
5,"ZYMANTAR,MARK E",POLICE OFFICER,NaN,8443000.0
6,"ZYRKOWSKI,CARLD E",CHEF DATABASE ANALYS,POLICE,11330000.0
7,"ZYSKOWSKI,DARLIZ",POLICE OFFICER,POLICE,NaN

In [89]:
"Hello My Name is Valla".split()

['Hello', 'My', 'Name', 'is', 'Valla']

In [91]:
con["Name"].str.split(",")

0          [AARON, ELVIA]
1      [AARON, JEFFDRY M]
2        [AARON, KIMBELE]
3      [ABAD JR, VICENTE]
4     [ZYGOWICE, PETER R]
5      [ZYMANTAR, MARK E]
6    [ZYRKOWSKI, CARLD E]
7     [ZYSKOWSKI, DARLIZ]
Name: Name, dtype: object

In [95]:
con["Name"].str.split(",").str.get(0)

0        AARON
1        AARON
2        AARON
3      ABAD JR
4     ZYGOWICE
5     ZYMANTAR
6    ZYRKOWSKI
7    ZYSKOWSKI
Name: Name, dtype: object

In [96]:
con["Name"].str.split(",").str.get(0).str.title().value_counts()

Aaron        3
Abad Jr      1
Zygowice     1
Zymantar     1
Zyrkowski    1
Zyskowski    1
Name: Name, dtype: int64

In [97]:
con["Position Title"]

0           WATER RATE TAKER
1             POLICE OFFICER
2             POLICE OFFICER
3    CHEF CONTRACT EXPEDITER
4            CIVIL ENGINEER
5             POLICE OFFICER
6       CHEF DATABASE ANALYS
7             POLICE OFFICER
Name: Position Title, dtype: object

In [101]:
con["Position Title"].str.split(" ").str.get(0).value_counts()

POLICE    4
CHEF      2
WATER     1
CIVIL     1
Name: Position Title, dtype: int64

# More Practice with splits

In [103]:
con=pd.read_csv(r"C:\Users\ELCOT\Downloads\txt_method.csv").dropna(how="all")
con["Department"]=con["Department"].astype("category")
con.head(4)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON,ELVIA",WATER RATE TAKER,WATER MGMNT,1000000.0
1,"AARON,JEFFDRY M",POLICE OFFICER,POLICE,2000000.0
2,"AARON,KIMBELE",POLICE OFFICER,POLICE,NaN
3,"ABAD JR,VICENTE",CHEF CONTRACT EXPEDITER,GENERAL SERVICES,6000000.0

In [110]:
con["Name"].str.split(",").str.get(0).value_counts().head(3)

AARON       3
ABAD JR     1
ZYGOWICE    1
Name: Name, dtype: int64

In [120]:
con["Name"].str.split(",").str.get(1).str.strip().str.split(' ').str.get(0).value_counts().head()

ELVIA      1
JEFFDRY    1
KIMBELE    1
VICENTE    1
PETER      1
Name: Name, dtype: int64

# The expand n and Parameters of the str .split() Method

In [121]:
con=pd.read_csv(r"C:\Users\ELCOT\Downloads\txt_method.csv").dropna(how="all")
con["Department"]=con["Department"].astype("category")
con.head(4)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON,ELVIA",WATER RATE TAKER,WATER MGMNT,1000000.0
1,"AARON,JEFFDRY M",POLICE OFFICER,POLICE,2000000.0
2,"AARON,KIMBELE",POLICE OFFICER,POLICE,NaN
3,"ABAD JR,VICENTE",CHEF CONTRACT EXPEDITER,GENERAL SERVICES,6000000.0

In [126]:
con["Name"].str.split(',',expand=True)

           0          1
0      AARON      ELVIA
1      AARON  JEFFDRY M
2      AARON    KIMBELE
3    ABAD JR    VICENTE
4   ZYGOWICE    PETER R
5   ZYMANTAR     MARK E
6  ZYRKOWSKI    CARLD E
7  ZYSKOWSKI     DARLIZ

In [137]:
con[["FirstName","LastName"]] = con["Name"].str.split(',',expand=True)
con.head()

,Name,Position Title,Department,Employee Annual Salary,First,Last,FirstName,LastName
0,"AARON,ELVIA",WATER RATE TAKER,WATER MGMNT,1000000.0,AARON,ELVIA,AARON,ELVIA
1,"AARON,JEFFDRY M",POLICE OFFICER,POLICE,2000000.0,AARON,JEFFDRY M,AARON,JEFFDRY M
2,"AARON,KIMBELE",POLICE OFFICER,POLICE,NaN,AARON,KIMBELE,AARON,KIMBELE
3,"ABAD JR,VICENTE",CHEF CONTRACT EXPEDITER,GENERAL SERVICES,6000000.0,ABAD JR,VICENTE,ABAD JR,VICENTE
4,"ZYGOWICE,PETER R",CIVIL ENGINEER,WATER MOMENT,5000000.0,ZYGOWICE,PETER R,ZYGOWICE,PETER R

In [140]:
con[["FirstTitle","SecondTitle"]]=con["Position Title"].str.split(" ",expand=True,n=1)
con.head()

,Name,Position Title,Department,Employee Annual Salary,First,Last,FirstName,LastName,FirstTitle,SecondTitle
0,"AARON,ELVIA",WATER RATE TAKER,WATER MGMNT,1000000.0,AARON,ELVIA,AARON,ELVIA,WATER,RATE TAKER
1,"AARON,JEFFDRY M",POLICE OFFICER,POLICE,2000000.0,AARON,JEFFDRY M,AARON,JEFFDRY M,POLICE,OFFICER
2,"AARON,KIMBELE",POLICE OFFICER,POLICE,NaN,AARON,KIMBELE,AARON,KIMBELE,POLICE,OFFICER
3,"ABAD JR,VICENTE",CHEF CONTRACT EXPEDITER,GENERAL SERVICES,6000000.0,ABAD JR,VICENTE,ABAD JR,VICENTE,CHEF,CONTRACT EXPEDITER
4,"ZYGOWICE,PETER R",CIVIL ENGINEER,WATER MOMENT,5000000.0,ZYGOWICE,PETER R,ZYGOWICE,PETER R,CIVIL,ENGINEER